backend/load-test.yaml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 40
  processor: "./auth-token.js"
  payload:
    path: "./users.csv"
    fields:
      - username
      - password

scenarios:
  - name: "Авторизация и запросы"
    flow:
      - post:
          url: "/api/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            json: "$.token"
            as: "authToken"

      - get:
          url: "/api/recipes"
          headers:
            Authorization: "Bearer {{ authToken }}"